In [1]:
import pandas as pd

In [2]:
frame = pd.DataFrame({'numbers':range(10),'chars':['a']*10})

In [3]:
frame=pd.read_csv('dataset.tsv',header=0,sep='\t')

In [4]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [5]:
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [6]:
frame.shape

(6, 4)

In [7]:
new_line = {'Name':'Perov','Birth':'22.03.1988','City':'Penza'}

In [8]:
frame.append(new_line,ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1988      Penza       NaN

In [9]:
frame=frame.append(new_line,ignore_index=True)

In [10]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1988      Penza       NaN

In [24]:
frame['IsStudent']=[False]*5 +[True]*2

In [45]:
frame

              Name       Birth       City  Position    job
0      Иванов А.А.  22.03.1980     Москва       NaN  False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер  False
2       Белов М.М.  13.02.1980     Ростов  менеджер  False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN  False
4      Рыбина Е.П.  19.11.1985     Москва   инженер  False

In [20]:
job='employee'

In [58]:
frame['job']=[False]*3+[True]*2

In [59]:
frame['job']=[False,True,False,False,False]

In [74]:
frame

              Name       Birth       City  Position    job  employee
0      Иванов А.А.  22.03.1980     Москва       NaN  False     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер   True     False
2       Белов М.М.  13.02.1980     Ростов  менеджер  False     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN  False      True
4      Рыбина Е.П.  19.11.1985     Москва   инженер  False      True

In [60]:
frame[job]=[False]*3+[True]*2

In [61]:
frame

              Name       Birth       City  Position    job  employee
0      Иванов А.А.  22.03.1980     Москва       NaN  False     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер   True     False
2       Белов М.М.  13.02.1980     Ростов  менеджер  False     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN  False      True
4      Рыбина Е.П.  19.11.1985     Москва   инженер  False      True

In [62]:
frame['Name']

0        Иванов А.А.
1       Сорокин И.В.
2         Белов М.М.
3    Мельникова Д.С.
4        Рыбина Е.П.
Name: Name, dtype: object

In [63]:
frame.Name

0        Иванов А.А.
1       Сорокин И.В.
2         Белов М.М.
3    Мельникова Д.С.
4        Рыбина Е.П.
Name: Name, dtype: object

In [64]:
frame.drop([5,6],axis=0)

KeyError: '[5 6] not found in axis'

In [65]:
frame

              Name       Birth       City  Position    job  employee
0      Иванов А.А.  22.03.1980     Москва       NaN  False     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер   True     False
2       Белов М.М.  13.02.1980     Ростов  менеджер  False     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN  False      True
4      Рыбина Е.П.  19.11.1985     Москва   инженер  False      True

In [66]:
frame.drop([5,6],axis=0,inplace=True)

KeyError: '[5 6] not found in axis'

In [67]:
frame

              Name       Birth       City  Position    job  employee
0      Иванов А.А.  22.03.1980     Москва       NaN  False     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер   True     False
2       Белов М.М.  13.02.1980     Ростов  менеджер  False     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN  False      True
4      Рыбина Е.П.  19.11.1985     Москва   инженер  False      True

In [68]:
frame.drop('IsStident',axis=1,inplace=True)

KeyError: "['IsStident'] not found in axis"

In [69]:
frame

              Name       Birth       City  Position    job  employee
0      Иванов А.А.  22.03.1980     Москва       NaN  False     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер   True     False
2       Белов М.М.  13.02.1980     Ростов  менеджер  False     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN  False      True
4      Рыбина Е.П.  19.11.1985     Москва   инженер  False      True

In [70]:
frame.drop('IsStudent',axis=1,inplace=True)

KeyError: "['IsStudent'] not found in axis"

In [71]:
frame

              Name       Birth       City  Position    job  employee
0      Иванов А.А.  22.03.1980     Москва       NaN  False     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер   True     False
2       Белов М.М.  13.02.1980     Ростов  менеджер  False     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN  False      True
4      Рыбина Е.П.  19.11.1985     Москва   инженер  False      True

In [72]:
frame.to_csv('updated_dataset.csv',sep=',',header=True,index=False)

In [75]:
frame

              Name       Birth       City  Position    job  employee
0      Иванов А.А.  22.03.1980     Москва       NaN  False     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер   True     False
2       Белов М.М.  13.02.1980     Ростов  менеджер  False     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN  False      True
4      Рыбина Е.П.  19.11.1985     Москва   инженер  False      True

In [77]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
job           bool
employee      bool
dtype: object

In [78]:
frame.Birth=frame.Birth.apply(pd.to_datetime)

In [79]:
frame

              Name      Birth       City  Position    job  employee
0      Иванов А.А. 1980-03-22     Москва       NaN  False     False
1     Сорокин И.В. 1965-07-08  Волгоград   инженер   True     False
2       Белов М.М. 1980-02-13     Ростов  менеджер  False     False
3  Мельникова Д.С. 1985-04-15     Ростов       NaN  False      True
4      Рыбина Е.П. 1985-11-19     Москва   инженер  False      True

In [81]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
job                   bool
employee              bool
dtype: object

In [82]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 6 columns):
Name        5 non-null object
Birth       5 non-null datetime64[ns]
City        5 non-null object
Position    3 non-null object
job         5 non-null bool
employee    5 non-null bool
dtypes: bool(2), datetime64[ns](1), object(3)
memory usage: 370.0+ bytes

In [84]:
frame.fillna('разнорабочий',inplace=True)

In [85]:
frame

              Name      Birth       City      Position    job  employee
0      Иванов А.А. 1980-03-22     Москва  разнорабочий  False     False
1     Сорокин И.В. 1965-07-08  Волгоград       инженер   True     False
2       Белов М.М. 1980-02-13     Ростов      менеджер  False     False
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий  False      True
4      Рыбина Е.П. 1985-11-19     Москва       инженер  False      True

In [86]:
frame[['Position']]

       Position
0  разнорабочий
1       инженер
2      менеджер
3  разнорабочий
4       инженер

In [87]:
frame[['Name','Position']]

              Name      Position
0      Иванов А.А.  разнорабочий
1     Сорокин И.В.       инженер
2       Белов М.М.      менеджер
3  Мельникова Д.С.  разнорабочий
4      Рыбина Е.П.       инженер

In [88]:
frame[:3]

           Name      Birth       City      Position    job  employee
0   Иванов А.А. 1980-03-22     Москва  разнорабочий  False     False
1  Сорокин И.В. 1965-07-08  Волгоград       инженер   True     False
2    Белов М.М. 1980-02-13     Ростов      менеджер  False     False

In [95]:
frame.head(2) # s nachala

           Name      Birth       City      Position    job  employee
0   Иванов А.А. 1980-03-22     Москва  разнорабочий  False     False
1  Сорокин И.В. 1965-07-08  Волгоград       инженер   True     False

In [96]:
frame.tail(1) #s kontsa

          Name      Birth    City Position    job  employee
4  Рыбина Е.П. 1985-11-19  Москва  инженер  False      True

In [97]:
frame[-2:] #s kontsa

              Name      Birth    City      Position    job  employee
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий  False      True
4      Рыбина Е.П. 1985-11-19  Москва       инженер  False      True

In [98]:
frame.loc[[0,1,2],['Name','City']] # rabotajut na osnovje imen

           Name       City
0   Иванов А.А.     Москва
1  Сорокин И.В.  Волгоград
2    Белов М.М.     Ростов

In [100]:
frame.iloc[[1,3,4],[0,1]] #rabotajut na osnove positsii

              Name      Birth
1     Сорокин И.В. 1965-07-08
3  Мельникова Д.С. 1985-04-15
4      Рыбина Е.П. 1985-11-19

In [101]:
frame[frame.Birth >=pd.datetime(1985,1,1)]

              Name      Birth    City      Position    job  employee
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий  False      True
4      Рыбина Е.П. 1985-11-19  Москва       инженер  False      True

In [104]:
frame[(frame.Birth >=pd.datetime(1985,1,1)) &
      (frame.City != 'Москва')]

              Name      Birth    City      Position    job  employee
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий  False      True

In [105]:
frame[(frame.Birth >=pd.datetime(1985,1,1)) |
      (frame.City == 'Волгоград')]

              Name      Birth       City      Position    job  employee
1     Сорокин И.В. 1965-07-08  Волгоград       инженер   True     False
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий  False      True
4      Рыбина Е.П. 1985-11-19     Москва       инженер  False      True

In [107]:
frame1=frame[(frame.Birth >=pd.datetime(1985,1,1)) |
      (frame.City == 'Волгоград')]

In [108]:
frame1

              Name      Birth       City      Position    job  employee
1     Сорокин И.В. 1965-07-08  Волгоград       инженер   True     False
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий  False      True
4      Рыбина Е.П. 1985-11-19     Москва       инженер  False      True